{"data":{"site":{"siteMetadata":{"title":"Overreacted","author":"Dan Abramov"}},"markdownRemark":{"id":"1ee81e3e-2e39-521a-bc19-31347ed40022","excerpt":"Development Model JSX - Empowering the more powerful language Components - Build things in isolation Component Model was liked so much by…","html":"<h2>Development Model</h2>\n<ul>\n<li>JSX - Empowering the more powerful language</li>\n<li>Components - Build things in isolation</li>\n<li>Component Model was liked so much by Facebook that even their iOS team created componentKit inspired by it.</li>\n</ul>\n<h2>Production Ready</h2>\n<ul>\n<li>Dogfooding</li>\n<li>50,000 components on facebook</li>\n<li>Instagram, fb, WhatsApp within Facebook</li>\n<li>Airbnb, Uber, Netflix, Pinterest, Lyft, WeWork, zomato, Flipkart, Dropbox, Slack, Discord, Pluralsight (Community Driven)</li>\n</ul>\n<h2>Unix Philosophy</h2>\n<ul>\n<li>Doing One thing, Well</li>\n<li>One Library to solve one problem</li>\n</ul>\n<h2>Ecosystem Around React</h2>\n<ul>\n<li>GraphQL, Flow, ImmutableJs, Relay, Nuclide, Jest</li>\n</ul>\n<h2>Beyond Web</h2>\n<ul>\n<li>React Native</li>\n<li>React 360</li>\n</ul>\n<h1>Script</h1>\n<p>Facebooks monthly active user base has skyrocketed to 2.23 Billion users. So has been with its other networks Instagram and WhatsApp with 1 and 1.5 Billion respectively.</p>\n<p>An extraordinary growth has led to the creation of extraordinary tools and products. For example, when Facebook saw a lot of its users with low-end devices struggled to install the Facebook app due to the lack of storage space. Due to that Facebook came up with a stripped down version called Facebook Lite. It weighs only 1.6 MB compared to the whopping 58 MB normal version. Facebook didn’t stop there, It also optimized the app for low-performance internet by lowering the quality of media content.</p>\n<p>When Facebook struggled to create complex user interfaces, it came up with React. A technology to build user interfaces using components as a basic building block.  Some of React’s practices were against the software industry’s convention.</p>\n<p>For example, industry when the industry showed outrage cause they believed keeping HTML, CSS, and JavaScript files different places for separation of concern whereas React believed in keeping them together. React’s advocate counter-argued explaining “Hey that’s not separation of concern but rather separation of technology”. React’s does believe in separation of concern but on the grounds of components.</p>\n<p>Components are like pieces of lego, which are joined to create bigger components. Every component can have its own style and business logic.</p>\n<h1>Sources</h1>\n<ul>\n<li><a href=\"https://twitter.com/dan_abramov/status/972848952138780675?lang=en\">Dan Abramov on Twitter: “In addition to the ecosystem, we have over 50,000 React components at Facebook and can’t just change their behavior. This motivates our recent and ongoing work on better lifecycles (e.g. getDerivedStateFromProps). You can provide feedback on our RFCs: https://t.co/ZoWIDk9bbr”</a></li>\n<li><a href=\"https://techcrunch.com/2018/06/20/instagram-1-billion-users/\">Instagram hits 1 billion monthly users, up from 800M in September – TechCrunch</a></li>\n<li><a href=\"https://techcrunch.com/2018/01/31/whatsapp-hits-1-5-billion-monthly-users-19b-not-so-bad/\">WhatsApp hits 1.5 billion monthly users. $19B? Not so bad. – TechCrunch</a></li>\n<li><a href=\"https://www.statista.com/statistics/264810/number-of-monthly-active-facebook-users-worldwide/\">•  Facebook users worldwide 2018 | Statista</a></li>\n<li><a href=\"https://www.guidingtech.com/facebook-vs-facebook-lite-comparison/\">Facebook vs Facebook Lite: Which App Should You Use?</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=MGuKhcnrqGA\">React.js Conf 2016 - Nick Schrock - Keynote - YouTube</a></li>\n<li><a href=\"https://medium.freecodecamp.org/designing-reusable-react-components-1cbeb897b048\">Designing Reusable React Components – freeCodeCamp.org</a></li>\n</ul>","timeToRead":2,"frontmatter":{"title":"How Facebook is Changing Web Development Landscape","date":null}}},"pageContext":{"slug":"/How Facebook is Changing Web Development Landscape/","previous":{"fields":{"slug":"/why-do-react-elements-have-typeof-property/"},"frontmatter":{"title":"Why Do React Elements Have a $$typeof Property?"}},"next":null}}