{"data":{"site":{"siteMetadata":{"title":"TrakBit","author":"Harsh Vardhan"}},"markdownRemark":{"id":"dfd1fb07-d0e8-5f93-afd4-0dab021d4b7e","excerpt":"Before feeling horrified by the name  junk  bond , we would like to remind you with two recent events. Netflix  is issuing $2 billion value…","html":"<p>Before feeling horrified by the name <span style=\"color:red\"><em>junk</em> bond</span>, we would like to remind you with two recent events.</p>\n<ol>\n<li><u><em>Netflix</em></u> is issuing $2 billion value of junk bond on September 30th, 2018</li>\n<li><u><em>Uber</em></u> is offering $1.5 billion value of junk bond on October 18th, 2018</li>\n</ol>\n<p>Why did the two tech giant of today’s time choose junk bond as their financing option? And why so many investors are after these offers? Let’s dive in to understand the concept of junk bond and what role it plays in the market.</p>\n<p><strong>What is junk bond?</strong></p>\n<p><strong>Junk bond</strong>, also known as <strong>high-yield bond</strong>, is issued by lower than investment-graded firms. The three most well-known credit rating institutions are Moody’s, Standard and Poor and Fitch. Each has its own rating scale to <u>rank firms or even countries from the most creditworthiness to the least</u>. However, one similarity is that each rating scale has a benchmark from which above is investment-graded and from which below is considered “junk”. Junk bond status is applied to bonds rated BB or below on S&#x26;P scale or Ba and lower on Moody’s scale. The <em>lower</em> the rating, the <em>higher</em> the risk that payments on principal and interest will not be made by the issuers. To compensate for the risky nature, junk bond often <u>offers higher interest rates than other investment-graded bonds</u>. Normally, junk bond interest rates are 4 to 6 point higher than that of Treasury bond, which is often used as a benchmark for all financial instruments.</p>\n<p>Despite the <em>stigmatized</em> name, junk bond is a great financing tools for firms and investment tools for investors. At certain points in time, junk bond even outperformed the stock market as shown in the below chart, which compares the return of high-yield bond (HYG) with the stock return (S&#x26;P 500). </p>\n<p><img src=\"C:%5CUsers%5Cm%5CPictures%5Chigh-yield%20bond.png\" alt=\"high-yield bond return versus S&#x26;P500 return\"></p>\n<p><strong>Why firms opt to junk bond as financing method?</strong></p>\n<p>Junk bond was considered a phenomenal invention of the capital market because it helped unlock and grow new pools of wealth. Before the late 1970s when high-yield bond was invented, new-born and low rated firms could hardly raise capital to expand their businesses because they lacked historical sales records or collaterals to secure bank loans or to issue investment-graded corporate bonds. Michael Milken, the founding father of junk bond as we know to day, saw the struggle of businesses and realized that the default rate could be much lower than the return. He then convinced the bank he worked for, Drexel Burnham Lambert, to underwrite high-yield bonds for businesses. That invention marked a glory 1980s decade of using high-yield bonds as a key source of capital by all types of businesses. Small businesses were able to raise capital to grow; big corporations could use high-yield bonds for leverage buyouts (LBOs) <sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> and whoever struggling with the current business models can get fund to restructure their companies. Many household brands like General Motors, Ford, United Airlines and Nokia used to rely on junk bond for such purposes. </p>\n<p>Although junk bond is not the only financing method a business can resort to, it has certain advantages over other types of financing options. The table below lists some of the pros and cons of each financing tool that a company can use.</p>\n<table>\n<thead>\n<tr>\n<th>Financing tools</th>\n<th align=\"left\">Pros</th>\n<th>Cons</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Bank loan</td>\n<td align=\"left\">predictable monthly payment</td>\n<td>lengthy procedures; binding conditions</td>\n</tr>\n<tr>\n<td>Venture Capital</td>\n<td align=\"left\">ample money + expertise</td>\n<td>control by board of VCs</td>\n</tr>\n<tr>\n<td>Issuing shares</td>\n<td align=\"left\">no obligations to investors</td>\n<td>lower EPS, costly</td>\n</tr>\n<tr>\n<td>Issuing bonds</td>\n<td align=\"left\">cheap and fast; no collaterals (<em>for junk bond</em>)</td>\n<td>obligations to investors</td>\n</tr>\n</tbody>\n</table>\n<p>In short, bond is a cheap, fast and easy way to raise capital while the directors of the companies can still enjoy full control without having to obey to too many conditions required by bankers or VCs board members. Moreover, unlike the case when companies issue more shares to raise capital, the owners of the firms that issue bond only need to make fixed interest payments to bondholders and keep a huge chunk of profits for themselves.</p>\n<p><strong>Why do we invest in junk bond?</strong></p>\n<p>To make <strong>money</strong> :dollar:, of course! Investors often look for <em>high risk</em> but <em>high return</em> financial instruments along side other safe investments to diversify their portfolios and to earn extra returns if the economy does well. Basically, there are <strong>two</strong> ways investors can make money from junk bond, either by its coupon rate (<em>interest</em> rate) or by speculation on bond prices.</p>\n<p>The <em>first</em> way is no brainer. You can purchase  <span style=\"color:green\"><strong>$10,000</strong></span> of high-yield bonds which promise, let’s say, 10% per year interest rate (<em>coupon rate printed on the bond note</em>). The bonds mature in 10 years. So the amount of return you can get will be:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Return =  interest in 10 years\n\n       =  $10,000 x 10% x 10 years \n\n       =  $10,000</code></pre></div>\n<p>And don’t forget to take back your <strong>initial investment</strong> of  <span style=\"color:green\"><strong>$10,000</strong></span> at the maturity of the bond you has purchased.</p>\n<p>The <em>second</em> way depends on the prices of bond in the market. Similar to stockholders, bondholders can trade (<em>buy and sell</em>) their bonds in the bond market. Bond prices thus fluctuates according to the demand and supply. So if the companies whose bonds you have purchased do well and get their credit rating upgraded, more people would want to get their hands on those companies’ bonds. Prices of those bonds may increase, let’s say, from <span style=\"color:green\"><strong>$10,000</strong></span> to  <span style=\"color:green\"><strong>$11,500</strong></span>. You can sell your bonds and make  <span style=\"color:green\"><strong>$1,500</strong></span> extra instantly (<em>equivalent to 15% return</em>). However, once selling the bonds, you won’t have any future interest income from the assets.</p>\n<p><strong>What to keep in mind when investing in junk bond?</strong></p>\n<p>Only <strong>3</strong> things:</p>\n<ol>\n<li>Your <span style=\"color:red\"><em>risk appetite</em></span></li>\n<li><span style=\"color:red\"><em>Current performance</em></span> and <span style=\"color:red\"><em>growth potential</em></span> of the bond issuers</li>\n<li><span style=\"color:red\"><em>Macroeconomic</em></span> conditions</li>\n</ol>\n<p><span style=\"color:red\"><em>Risk appetite</em></span> refers to the level of risk that you can take. Some people prefer risky investment while others want to play on the safe side. It is similar to people with different tastes of food. Some like spicy, some like sweet. For those who want to take a bit of risk, high-yield bond is an option that they should consider. However, always remember to diversify your portfolios because all in for high-yield bond is not a prudent idea.</p>\n<p><span style=\"color:red\"><em>Current performance</em></span> and <span style=\"color:red\"><em>growth potential</em></span> of the bond issuers refers to the fundamental analysis about the companies whose bonds you purchase. For example, if you want to buy Netflix bond, what you need to look at is its current proposition in the market. Up until now, Netflix is the major player in the movie streaming service, which no doubt will become the dominant mean of entertainment in the near future. Going through Netflix’s financial statement, you can find out that the company is having growing net income. Netflix is also expected to reach  200 million of subscribers by 2021. And its revenue streams will become more stable once it has its own shows and not relying too much on others producers for movie licensing. However, it is facing strong competition from Disney+, a new movie streaming platform made by Disney. Besides, Netflix share price is falling along with other tech giants.</p>\n<p><span style=\"color:red\"><em>Macroeconomic</em></span> conditions will tell you if this is a good time to buy high-yield bonds in general. One distinct feature of junk bond market that you should bear in mind is that it is highly sensitive to stress condition. People often buy high-yield bonds when overall interest rate level is low, when the future for growth seems promising, a.k.a the expansion of the economy. And they will dump high-yield bond when overall interest rate level is high, when there is fear of economic crisis, or in other words, the contraction of the economy. For example, the current macroeconomic conditions right now are not very optimistic for bond buyers. It seems that we are about to meet the end of the expansion cycle when FED continued to raise interest rate level and ECB will soon finish its quantitative easing era. In other words, cheap credit is about to end. People will tend to pull out from riskier high-yield bond and purchase safer instruments like Treasury bills now that its interest rate has risen up. Another factor such as the amount of corporate debt has piled up to the alarming figure of $6.3 trillion, which is higher than the pre-2008 crisis level and the falling of tech giants’ stock prices, can also be a warning sign for the general health of the financial market. </p>\n<p><strong>Conclusion</strong></p>\n<p>Overall, junk bond is an <em>useful, cheap</em> and <em>fast</em> financing option for corporations and a <em>risky</em> but <em>good-returned</em> investment tool for investors. To decide whether to buy junk bonds, we should take into account both micro and macro factors. None of the factors should be more important than the other. They are pieces of jigsaw puzzle that we must place together to see the full picture. And seeing the full picture and not some distinctive details is what we need to do before deciding to buy junk bonds or any other types of financial instruments.</p>\n<p><em>For more in-depth explanation about junk-bond with lively animation, please visit Explainoid youtube channel at &#x3C;www.youtube.com>. Guarantee it will be useful and fun to watch :smiley:</em></p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>a type of merger and acquisition that use a significant amount of borrowed money (<em>debt</em>)</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","timeToRead":7,"frontmatter":{"title":"Junk Bond","date":"December 02, 2018"}}},"pageContext":{"slug":"/Junk Bond/","previous":{"fields":{"slug":"/Flow - It’s Not Just About Static Typing/"},"frontmatter":{"title":"Flow: It’s Not Just About Static Typing"}},"next":{"fields":{"slug":"/Reselect with Redux: A Use Case/"},"frontmatter":{"title":"Reselect with Redux: A Use Case"}}}}